// import React from 'react';
// import News2 from './News2';
// import News3 from './News3';
// import TopNews from './TopNews';
// import Footer from '../Footer/Footer';
// import News4 from './News4';

// const news = [
//     {
//         "id": "985aae1b",
//         "title": "নিম্ন আয়ের ৩৫ লাখ পরিবার পাবে প্রধানমন্ত্রীর সহায়তা",
//         "sup-title": "করোনাভাইরাস পরিস্থিতি",
//         "description": "করোনাভাইরাসের সংক্রমণ পরিস্থিতিতে নিম্ন আয়ের প্রায় ৩৫ লাখ পরিবারকে আড়াই হাজার টাকা করে আর্থিক সহায়তা দেবেন প্রধানমন্ত্রী শেখ হাসিনা। এ ছাড়া সম্প্রতি প্রাকৃতিক দুর্যোগে ক্ষতিগ্রস্ত এক লাখ কৃষক পরিবার পাবে পাঁচ হাজার করে। এ জন্য সরকারের ৯৩০ কোটি টাকা ব্যয় হবে। প্রধানমন্ত্রীর প্রেস সচিব ইহসানুল করিম রোববার বার্তা সংস্থা বাসসকে এ তথ্য জানিয়েছেন।",
//         "photo": "https://images.prothomalo.com/prothomalo-bangla%2F2021-02%2Fa57ebbd7-88a7-47ba-8b57-0c8f4885cc5b%2FUntitled_1.jpg",
//         "time": "2021-04-18T21:44:01+06:00",
//         "sort": 2
//     },
//     {
//         "id": "d61d5bea",
//         "title": "আমার সরল মনের সরল উক্তি বিকৃত করা হয়েছে: মির্জা আব্বাস",
//         "sup-title": "",
//         "description": "ইলিয়াস আলীর নিখোঁজের পেছনে দলের নেতাদের সন্দেহ করে দেওয়া বক্তব্যের ২৪ ঘণ্টা পর সেই বক্তব্য অস্বীকার করেছেন দলের স্থায়ী কমিটির সদস্য মির্জা আব্বাস। তিনি বলছেন, ‘আমার কথাকে বিকৃত করা হয়েছে। আমার সহজ–সরল মনের সরল উক্তিগুলোকে বিকৃত করে যার যেখান থেকে প্রয়োজন কেটেছিঁড়ে ইচ্ছেমতো লাগিয়ে দেওয়া হয়েছে।’",
//         "photo": "https://images.prothomalo.com/prothomalo-bangla/2021-04/bdfc0f6b-c4f1-4816-bfcd-1acb6c95ab5c/frame.png",
//         "time": "2021-04-18T18:49:01+06:00",
//         "sort": 4
//     },
//     {
//         "id": "b5a41f4b",
//         "title": "করোনার দ্বিতীয় ঢেউ কীভাবে সামলানো যাবে",
//         "sup-title": "মতামত",
//         "description": "গত ফেব্রুয়ারি ২০২১-এ সংক্রমণ কমে যাওয়ায় মানুষ স্বস্তির নিশ্বাস ফেলেছিল। করোনা বিদায় নিয়েছে ভেবে মানুষ বেপরোয়া হয়ে গিয়েছিল। স্বাস্থ্যবিধি মানার বালাই ছিল না, ধর্মীয় ও সামাজিক অনুষ্ঠানে ব্যাপক জনসমাগম হচ্ছিল। পর্যটন কেন্দ্রগুলোতে মানুষ উপচে পড়ছিল। ফলে যা হওয়ার, মার্চ ২০২১ থেকে করোনা ব্যাপক সংক্রমণ লক্ষ করা যাচ্ছে। প্রতিদিন মৃত্যুর সারি দীর্ঘতর হচ্ছে। ফলে সরকার করোনা নিয়ন্ত্রণে পয়লা বৈশাখ থেকে এক সপ্তাহের জন্য লকডাউন ঘোষণা করেছে, এ সীমা হয়তো আরও বর্ধিত হতে পারে।",
//         "photo": "https://images.prothomalo.com/prothomalo-bangla%2F2021-04%2F85fab35f-9d15-4be7-a714-4a6f6b5d63a9%2FCovid.jpg",
//         "time": "2021-04-18T19:32:28+06:00",
//         "sort": 5
//     }
// ]

// const News = () => {
//     return (
//         <div className='px-5'>
//             <div className='row'>
//                 <div className='col-md-9 '>
//                     <TopNews></TopNews>
//                     <div className='row ps-5'>
//                         {
//                             news.map(n => <News2 key={n.id} n={n}></News2>)
//                         }
//                     </div>
//                     <hr />
//                     <News4></News4>
//                 </div>
//                 <News3></News3>
//                 <hr />
//             </div>
//             <Footer></Footer>
//         </div>
//     );
// };

// export default News;